{"https://blog.samaltman.com/sora-update-number-1": "Sam Altman announces two major changes coming to Sora based on user feedback and learning from the platform's usage since launch. First, Sora will give rightsholders more granular control over character generation, similar to existing likeness opt-in models, allowing them to specify how their characters can be used, with particular acknowledgment of the strong connection users have with Japanese content. Second, OpenAI plans to implement revenue generation for video creation since users are generating much more content than expected, often for small audiences, and they intend to share some of this revenue with rightsholders whose characters are being generated. Altman emphasizes they expect a high rate of change and iteration, similar to the early days of ChatGPT, and will apply lessons learned in Sora across all their products.", "https://blog.samaltman.com/sora-2": "Sam Altman announces the launch of Sora, a new app combining the Sora 2 model with a product that makes video creation, sharing, and viewing easy, describing it as the \"ChatGPT for creativity\" moment. He believes this could trigger a \"Cambrian explosion\" in creativity and drastically increase the quality of art and entertainment, with features like character consistency and cameo abilities allowing users to put themselves and friends into videos. However, the team acknowledges concerns about potential negative impacts including addiction, bullying, and the risk of users being drawn into \"RL-optimized slop feeds\" similar to problematic aspects of social media. To address these concerns, they've established principles focusing on long-term user satisfaction, giving users control over their feeds, and prioritizing creation over consumption.", "https://blog.samaltman.com/abundant-intelligence": "Sam Altman discusses the explosive growth of AI services and argues that AI access will become a fundamental economic driver and potentially a human right. He outlines the massive compute infrastructure needed to support future AI capabilities, suggesting that with 10 gigawatts of compute, AI could solve major problems like cancer or provide personalized education globally. OpenAI's ambitious vision is to build a factory capable of producing a gigawatt of new AI infrastructure every week, requiring innovation across chips, power, buildings, and robotics. While acknowledging this will take years and be extremely difficult, Altman emphasizes the importance of building this infrastructure in the US to compete globally and plans to share details about partnerships and financing in the coming months.", "status": "success"}