{"https://myanimelist.net/news/73400701": "The official website announced that the anime adaptation of 'Kimi no Koto ga Daidaidaidaidaisuki na 100-nin no Kanojo' (also known as Hyakkano) will receive a third season premiering in 2026. The comedy harem anime, produced by Bibury Animation Studios, had its first season air in Fall 2023 with 12 episodes, followed by a second season that premiered in Summer 2025. The series is based on Rikito Nakamura and Yukiko Nozawa's manga that launched in Young Jump magazine in December 2019 and has achieved 2.2 million copies in circulation across 23 published volumes. Crunchyroll streams the anime internationally with subtitles and dubs in multiple languages, while Seven Seas Entertainment has licensed the English manga release under its Ghost Ship imprint.", "https://myanimelist.net/news/73397884": "Production company Kadokawa announced a television anime adaptation of Ayune Araragi's manga 'Isshiki-san wa Koi wo Shiritai.' (Isshiki-san Wants to Know About Love.) on Friday, opening an official website for the adaptation. The romantic comedy manga was originally serialized as 'Rinna Keibu wa Iki ga Dekinai' in Comic REX magazine from 2016-2017 before being relaunched in Monthly Shounen Ace magazine in December 2020. The story follows Inspector Rinna, a dedicated policewoman who becomes distracted by her partner Detective Meishi and must navigate the complexities of love while maintaining her professional duties. Kadokawa has published eight volumes of the manga with the ninth volume planned for release on October 23.", "https://myanimelist.net/news/73397707": "The official website for the television anime adaptation of Koucha Agasawa's manga 'Seihantai na Kimi to Boku' (You and I Are Polar Opposites) announced an additional cast pair on Friday, with Natsumi Nishi voiced by Cocoro Oomori and Rikako Honda voiced by Tomori Kusunoki. The anime is scheduled to air at 5:00 p.m. on MBS and TBS beginning January 2026, with Takakazu Nagatomo directing at Lapin Track studio and Teruko Utsumi handling series composition. The original romantic comedy manga was serialized on Shounen Jump+ web magazine starting as a one-shot in January 2021 before regular serialization began in May 2022, eventually ending its 3.5-year run with 65 chapters in November 2024. The manga has been published in English by both Manga Plus and VIZ Media, with Shueisha releasing the eighth and final volume in March 2024."}