{"https://36kr.com/p/3514480606075780": "Taobao Flash Sale made its debut in Double 11 2024 as a new hybrid business model combining 'far-field e-commerce + near-field retail', achieving explosive growth with multiple categories growing over 200% year-over-year and over 70% of cities seeing 200%+ growth in night snack orders. The platform attracted massive participation with over 4 million local life service merchants and 37,000 brands operating 400,000 stores, offering 1-4 hour delivery services that elevated logistics to hourly-level efficiency during the shopping festival. With current scale reaching 80 million weekly orders and 300 million monthly users, the service drove significant growth in Taobao's daily and monthly active users by 20% and 25% respectively. Alibaba projects this integration of instant retail and e-commerce will generate 1 trillion yuan in incremental transaction volume over the next three years, marking a significant evolution in China's retail landscape.", "https://36kr.com/p/3514451621075848": "轻松健康集团（Qingsong Health Group）近日获得证监会备案批准赴港上市，该公司由北京女CEO杨胤创立并领导。杨胤曾在IDG Inc.任职副总裁，2014年作为天使投资人投资轻松筹后辞职加入并担任CEO，将业务从众筹平台转向专注大病求助的医疗筹款服务。轻松筹平台已帮助数百万大病家庭筹集善款，并逐步向保险业务和综合健康服务拓展，公司也因此更名为轻松健康集团。2024年公司剥离了原有的轻松筹业务，现在杨胤即将迎来自己作为创业者的首次IPO。", "https://36kr.com/p/3514429338426503": "NVIDIA and TSMC unveiled the first Blackwell AI chip wafer manufactured on US soil at TSMC's Arizona facility, marking a historic milestone in bringing advanced semiconductor manufacturing back to America. The Blackwell chip features 208 billion transistors in a dual-chip design using TSMC's custom 4NP process, designed specifically for artificial intelligence applications with 10TB/s interconnect speed between the two sub-chips. Jensen Huang emphasized the historic significance of the achievement, stating that workers are part of a transformative moment while acknowledging TSMC's critical role in enabling NVIDIA's AI chip innovations. This collaboration represents TSMC's $165 billion investment in Arizona facilities and signals a major shift toward domestic production of the advanced chips powering global AI infrastructure.", "https://36kr.com/p/3514379783166084": "On October 16, Cao Dewang, the 80-year-old \"Glass King,\" announced his resignation as Chairman and Legal Representative of Fuyao Glass after over 30 years of leadership, citing the need to optimize corporate governance structure for sustainable development. Under his leadership, Fuyao Glass grew from a small township factory into the world's largest automotive glass manufacturer, holding over 65% of China's market share and 30% globally, with revenue growing from 236 billion yuan in 2021 to 392.5 billion yuan in 2024. His son Cao Hui, who has 10 years of co-management experience and previously led the North American operations, was unanimously elected as the new Chairman, while Cao Dewang will remain as \"Lifetime Honorary Chairman\" and continue as director of core subsidiaries. The company emphasized that this structured transition will not affect daily operations, with all established strategies, financial policies, and customer orders remaining stable, while Citigroup upgraded their profit forecasts and raised the target price in response to the leadership change.", "https://36kr.com/p/3514290006186883": "Xiaohongshu (Little Red Book) has launched a new second-hand trading feature called \"快捷售卖\" (Quick Selling) to directly compete with Alibaba's Xianyu platform, requiring users to have accounts over 180 days old with real-name verification and charging transaction fees of 0.6-1% based on annual sales volume. The platform leverages its superior algorithm capabilities to precisely match buyers and sellers based on content preferences and interests, giving it a potential advantage over established competitors in connecting users with similar needs. However, Xiaohongshu faces significant challenges including the lack of a robust trust and security system compared to Xianyu's established credit systems, the risk of users jumping to more trusted platforms for actual transactions, and potential infiltration by businesses that could damage the community atmosphere. While the feature may succeed in specific categories like local furniture sales or rental services, the article concludes that Xiaohongshu's success in this highly competitive second-hand market depends on its ability to overcome trust issues and build proper dispute resolution infrastructure, with the risk of remaining merely an \"information hub\" rather than a full transaction platform."}