{"https://x.com/karpathy/status/1756380066580455557": "Andrej Karpathy argues that much educational content on platforms like YouTube and TikTok is actually just entertainment disguised as learning, comparing it to snacking on 'Garden Veggie Straws' that seem healthy but aren't. He emphasizes that real learning should feel effortful, like 'mental sweating' at a gym, rather than quick and fun consumption. Karpathy advocates for explicitly declaring whether you're consuming or creating content for entertainment versus learning, as attempts to do both simultaneously fail. For genuine learning, he recommends closing quick blog posts and '10-minute' tutorials in favor of longform content like textbooks, papers, and manuals, with dedicated 4-hour study windows that involve active note-taking and processing.", "https://x.com/karpathy/status/1891720635363254772": "Andrej Karpathy received early access to Grok 3 and conducted a comprehensive evaluation of its capabilities across various tasks. The model performed well on complex problems like generating a Settlers of Catan hex grid webpage and estimating GPT-2 training FLOPs when using its thinking mode, though it struggled with emoji decoding and generating tricky tic-tac-toe boards. Grok 3 also features a new \"DeepSearch\" capability that combines research functionality with thinking, successfully answering various research questions about topics like Apple launches, Palantir stock, and White Lotus filming locations. Overall, Karpathy assessed Grok 3's capability as being around the level of OpenAI's o1-pro and ahead of DeepSeek-R1, though he noted that proper evaluations would be needed for definitive comparisons.", "https://x.com/karpathy/status/1957574489358873054": "Andrej Karpathy reports receiving approximately 10 spam calls and 5 spam messages daily, including automated voicemails and phishing attempts. Despite using AT&T Active Armor, being on Do Not Call lists, and enabling iOS \"Silence Unknown Callers,\" these spam communications continue to slip through his defenses. The spam comes from constantly changing, unique numbers, making blocking ineffective as a solution. He's seeking advice from others who might have found effective methods to combat this persistent spam problem.", "status": "success"}